       IDENTIFICATION DIVISION.
       PROGRAM-ID. PERFORM-TIMES.
       AUTHOR. Julien Gabryelewicz.
       DATA DIVISION.
       PROCEDURE DIVISION.
           PERFORM 5 TIMES
               DISPLAY "Hello, world!"
           END-PERFORM
           STOP RUN.
