       IDENTIFICATION DIVISION.
       PROGRAM-ID. HELLO-WORLD.
       AUTHOR. Julien Gabryelewicz.
       PROCEDURE DIVISION.
           DISPLAY 'Hello, world!'.
           STOP RUN.
