       IDENTIFICATION DIVISION.
       PROGRAM-ID. MULTIPLY-CALL.
       AUTHOR. Julien Gabryelewicz.
       DATA DIVISION.
	   LINKAGE SECTION.
	   01 PARAM1 PIC 9(1) VALUE ZEROS.
	   01 PARAM2 PIC 9(1) VALUE ZEROS.
	   01 ANSWER PIC 9(2) VALUE ZEROS.
       PROCEDURE DIVISION USING PARAM1, PARAM2, ANSWER.
           MULTIPLY PARAM1 BY PARAM2 GIVING ANSWER.
           EXIT PROGRAM.
